import view


menu_items = [
    'Главное меню',
    'Открыть файл',
    'Сохранить файл',
    'Показать контакты',
    'Создать контакт',
    'Найти контакт',
    'Изменить контакт',
    'Удалить контакт',
    'Выход',
]

input_choice = 'Выберете пункт меню:'

read_phonebook_successful = 'Телефонная книга успешно открыта'
save_phonebook_successful = 'Телефонная книга сохранена'
empty_book_error = 'Телефонная книга пуста или не открыта'

input_add_contact = (
    'Введите Имя',
    'Введите номер',
    'Введите комментарий',
)

error_choice = 'Ошибка выбора пункта меню.'

file_not_found = 'Файл не найден'

new_contact_successful = 'Контакт {name} успешно создан'

input_search_word = 'Введите слово для поиска: '

empty_find_error = 'Контакты содержащие "{word}" - не найдены'

input_id_to_edit = 'Введите ID для изменения '

input_edit_contact = [
    'Введите новое имя для изменения контакта,'
'Введите новый номер для изменения контакта ',
'Введите новый коммент для изменения контакта',
]

edit_contact_successful = 'Контакт "{name}" успешно изменен '

input_id_to_delete = 'Введите ID контакта для удаления:'

delete_contact_successful = 'Контакт "{name}" успешно удален'

exit_message = 'Выход'
